#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke-template/runs/run-jTG4RRRp8TckJMrV

Waiting for the plan to start...

Terraform v0.13.2
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.gke.module.primary-cluster.random_id.name["pool-01"]: Refreshing state... [id=n2k]
module.gke.random_id.run_id: Refreshing state... [id=j25Xbg]
module.gke.module.primary-cluster.random_string.cluster_service_account_suffix: Refreshing state... [id=56jm]
module.gke.module.cloud_nat.random_string.name_suffix: Refreshing state... [id=is7d3l]
module.gke.data.google_project.host_project: Refreshing state... [id=projects/test-gcp-project-01-274314]
module.gke.module.primary-cluster.data.google_client_config.default: Refreshing state... [id=2020-09-15 07:36:44.22122877 +0000 UTC]
module.gke.module.primary-cluster.data.google_compute_zones.available: Refreshing state... [id=2020-09-15 07:36:44.74311806 +0000 UTC]
module.gke.data.google_client_config.default: Refreshing state... [id=2020-09-15 07:36:44.194925297 +0000 UTC]
module.gke.data.google_project.service_project: Refreshing state... [id=projects/test-terraform-project-01]
module.gke.module.primary-cluster.google_compute_firewall.master_webhooks[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/global/firewalls/gke-test-template-1-8f6e576e-webhooks]
module.gke.module.primary-cluster.data.google_container_engine_versions.region: Refreshing state... [id=2020-09-15 07:36:44.754875904 +0000 UTC]
module.gke.module.primary-cluster.data.google_compute_subnetwork.gke_subnetwork[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/regions/asia-southeast2/subnetworks/test-private-vpc-subnet]
module.gke.module.primary-cluster.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/logging.logWriter/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.google_project_iam_binding.compute-network-user: Refreshing state... [id=test-gcp-project-01-274314/roles/compute.networkUser]
module.gke.module.primary-cluster.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.module.primary-cluster.data.google_container_engine_versions.zone: Refreshing state... [id=2020-09-15 07:36:45.069493952 +0000 UTC]
module.gke.module.primary-cluster.google_compute_firewall.intra_egress[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/global/firewalls/gke-test-template-1-8f6e576e-intra-cluster-egress]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.metricWriter/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.viewer/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.data.google_container_cluster.current_cluster: Refreshing state...
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=test-terraform-project-01/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke.google_compute_address.cloud_nat_ip will be created
  + resource "google_compute_address" "cloud_nat_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-nat"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.gke.module.bootstrap.helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v0.16.1"
      + wait                       = true
    }

  # module.gke.module.bootstrap.helm_release.jaeger will be created
  + resource "helm_release" "jaeger" {
      + atomic                     = false
      + chart                      = "jaeger-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "telemetry"
      + namespace                  = "observability"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jaegertracing.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.17.0"
      + wait                       = true

      + set {
          + name  = "jaeger.create"
          + value = "true"
        }
      + set {
          + name  = "rbac.clusterRole"
          + value = "true"
        }
    }

  # module.gke.module.bootstrap.null_resource.configure_kubectl will be created
  + resource "null_resource" "configure_kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.download_kubectl will be created
  + resource "null_resource" "download_kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_operator will be created
  + resource "null_resource" "install_Elastic_operator" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_resources will be created
  + resource "null_resource" "install_Elastic_resources" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_IstioOperator_manifest will be created
  + resource "null_resource" "install_IstioOperator_manifest" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_cert-manager_crds will be created
  + resource "null_resource" "install_cert-manager_crds" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_istio_operator will be created
  + resource "null_resource" "install_istio_operator" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.set_kiali_credentials will be created
  + resource "null_resource" "set_kiali_credentials" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.setup_gcloud_cli will be created
  + resource "null_resource" "setup_gcloud_cli" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.cloud_nat.google_compute_router.router[0] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-router"
      + network            = "test-private-vpc"
      + project            = "test-gcp-project-01-274314"
      + region             = "asia-southeast2"
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 64514
        }
    }

  # module.gke.module.cloud_nat.google_compute_router_nat.main will be created
  + resource "google_compute_router_nat" "main" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + min_ports_per_vm                   = 64
      + name                               = "cloud-nat-is7d3l"
      + nat_ip_allocate_option             = "MANUAL_ONLY"
      + nat_ips                            = (known after apply)
      + project                            = "test-gcp-project-01-274314"
      + region                             = "asia-southeast2"
      + router                             = "gke-router"
      + source_subnetwork_ip_ranges_to_nat = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30
    }

  # module.gke.module.primary-cluster.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = true
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "asia-southeast2"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "test-template-1-8f6e576e"
      + network                     = "projects/test-gcp-project-01-274314/global/networks/test-private-vpc"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = [
          + "asia-southeast2-a",
          + "asia-southeast2-b",
          + "asia-southeast2-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = "test-terraform-project-01"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/test-gcp-project-01-274314/regions/asia-southeast2/subnetworks/test-private-vpc-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = false
            }

          + dns_cache_config {
              + enabled = false
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = false
            }

          + horizontal_pod_autoscaling {
              + disabled = true
            }

          + http_load_balancing {
              + disabled = true
            }

          + istio_config {
              + auth     = "AUTH_MUTUAL_TLS"
              + disabled = true
            }

          + kalm_config {
              + enabled = false
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = "BALANCED"
          + enabled             = false

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = false
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "test-private-vpc-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "test-private-vpc-services"
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = 0
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = "default-pool"
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = "tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com"
              + taint             = (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = "GKE_METADATA_SERVER"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "10.0.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + release_channel {
          + channel = "RAPID"
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + identity_namespace = "test-terraform-project-01.svc.id.goog"
        }
    }

  # module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "test-template-1-8f6e576e"
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "asia-southeast2"
      + max_pods_per_node   = (known after apply)
      + name                = "pool-01-9f69"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + project             = "test-terraform-project-01"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 200
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "test-template-1-8f6e576e"
              + "node_pool"    = "pool-01"
            }
          + local_ssd_count   = 1
          + machine_type      = "n1-standard-2"
          + metadata          = {
              + "cluster_name"             = "test-template-1-8f6e576e"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "pool-01"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = "tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com"
          + tags              = [
              + "gke-test-template-1-8f6e576e",
              + "gke-test-template-1-8f6e576e-pool-01",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "3"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ca_certificate      = (known after apply)
  ~ client_token        = (sensitive value)
  + kubernetes_endpoint = (sensitive value)
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*